chtCodeTestCase-multiRegionRad-test-v3b/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 -0.01)
	(3 0 -0.01)
	(3 1 -0.01)
	(0 1 -0.01)
	(0 0 0.01)
	(3 0 0.01)
	(3 1 0.01)
	(0 1 0.01)
);



blocks
(
	hex (0 1 2 3 4 5 6 7) (200 50 1) simpleGrading (1 1 1)
);



edges
(
);

boundary
(
	maxY
	{
		type wall;
		faces
		(
		(3 7 6 2)
		);
	}
	
	minX
	{
		type wall;
		faces
		(
		(0 4 7 3)
		);
	}
	
	maxX
	{
		type wall;
		faces
		(
		(2 6 5 1)
		);
	}
		
	minY
	{
		type wall;
		faces
		(
		(1 5 4 0)
		);
	}

);




mergePatchPairs
(
);

// ************************************************************************* //
