chtCodeTestCase-multiRegionRad-test-v3b/constant/domain0/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

writeViewFactorMatrix     true;
writeFacesAgglomeration   true;
writePatchViewFactors     false;

//- Debug option
debug                     1;

//- Dump connectivity rays
dumpRays                  false;

".*" 
{
    nFacesInCoarsestLevel 100; // increase to get more radiation patches (coarse faces)
    featureAngle           30; // 0: one radiation patch (coarse face) over one cell face
}

//- Maximum length for dynamicList. See /applications/utilities/preProcessing/viewFactorsGen/shootRays.H
maxDynListLength        1000000000;





// ************************************************************************* //
