chtCodeTestCase-multiRegionRad-test-v3b/system/Mesh_2/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
T
{
	internalField   uniform 300;
	boundaryField
	{
		"Mesh_2_to_Mesh_1"
        {
           type            compressible::turbulentTemperatureRadCoupledMixed;
           Tnbr            T;
           thicknessLayers (1e-6);
           kappaLayers     (1e-4);
           kappaMethod     solidThermo;
           value           uniform 300;
        }
	}
}
// ************************************************************************* //
