chtCodeTestCase-multiRegionRad-test-v3b/system/domain0/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
T
{
	internalField	uniform 0;
	boundaryField
	{
		"(.*Y|.*X)"
  		{
            type            fixedValue;
			value			uniform 0;
        }
		"domain0_to_Mesh_1"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            qrNbr           none;
            qr              qr;
            value           uniform 0;
        }
	}
}
qr
{
	internalField	uniform 0;
	boundaryField
	{
		"(.*Y|.*X)"
        {
            type            greyDiffusiveRadiationViewFactor;
            emissivityMode  lookup;
            qro             uniform 0;
            emissivity      uniform 1.0;
            value           uniform 0;
        }
		"domain0_to_Mesh_1"
        {
            type            greyDiffusiveRadiationViewFactor;
            emissivityMode  solidRadiation;
            qro				uniform 1400;
            value           uniform 0;
        }
	}
}
boundary
{
    "(m.*|dom.*)"
    {
        inGroups        2(wall viewFactorWall);
    }
}

// ************************************************************************* //
